/**
 * [問題] 難易度：高
 * 日本でよく使われる紙幣は、10000円札、5000円札、1000円札です。
 * 以下、「お札」とはこれらのみを指します。
 * 青橋くんが言うには、彼が祖父から受け取ったお年玉袋にはお札がN枚入っていて、合計でY円だったそうですが、嘘かもしれません。
 * このような状況がありうるか判定し、ありうる場合はお年玉袋の中身の候補を一つ見つけてください。
 * なお、彼の祖父は十分裕福であり、お年玉袋は十分大きかったものとします。
 * N枚のお札の合計金額がY円となることがありえない場合は、-1 -1 -1 と出力してください。
 * N枚のお札の合計金額がY円となることがありうる場合は、そのようなN枚のお札の組み合わせの一例を「10000円札x枚、5000円札y枚、1000円札z枚」として、x、y、zを空白で区切って出力してください。
 * 複数の可能性が考えられるときは、そのうちどれを出力してもよいものとします。
 */
export const findOutLyingNewYearsGift = (
  n: number,
  y: number
): [number, number, number] => {
  // TODO
  // 下記のreturnは消して、自分の関数を作ってください。
  return [-1, -1, -1];
};
